# brew bundle --global

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "docutils"
brew "emacs", args: ["with-cocoa"]
brew "ghostscript"
brew "git-lfs"
brew "gnupg"
brew "imagemagick"
brew "libjpeg"
brew "librsvg"
brew "libtiff"
brew "libxmlsec1"
brew "libxslt"
brew "little-cms2"
brew "macvim"
brew "nvm"
brew "openconnect"
brew "openssl"
brew "pinentry-mac"
brew "pipenv"
brew "postgres", args: ["with-python"]
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "readline"
brew "redis"
brew "sqlite"
brew "tox"
brew "webp"
brew "xz"
brew "yarn"
brew "zlib"
brew "zsh"

cask "beardedspice"
cask "emacs"
cask "homebrew/cask-versions/java8"
cask "mactex"
cask "spotify"
cask "tripmode"
cask "wkhtmltopdf"


# pinentry setup:
# echo "pinentry-program /usr/local/bin/pinentry-mac" >> ~/.gnupg/gpg-agent.conf
