# brew bundle --global

cask_args appdir: "~/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "ag"
brew "cmake"
brew "docker-compose"
brew "readline"
brew "docutils"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "gpg"
brew "gnupg"
brew "imagemagick"
brew "java"
brew "libjpeg"
brew "librsvg"
brew "libtiff"
brew "libxmlsec1"
brew "libxslt"
# brew "little-cms2"
brew "nvm"
brew "openconnect"
brew "openssl"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "redis"
brew "sqlite"
brew "webp"
brew "xz"
brew "yarn"
brew "zlib"
brew "zsh"

cask "deepl"
cask "keepingyouawake"
cask "firefox"
# Harvest updates only available in the MacStore
# cask "harvest"
cask "iterm2"
cask "lastpass"
#cask "macvim"
cask "microsoft-teams"
cask "pycharm"
cask "slack"
cask "zoom"


# pinentry setup:
# echo "pinentry-program /usr/local/bin/pinentry-mac" >> ~/.gnupg/gpg-agent.conf
# echo "use-agent" >> ~/.gnupg/gpg.conf
# chmod 700 ~/.gnupg
# gpg --import <<<path-to-key>>>
