# brew bundle --global

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "cmake"
brew "docutils"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "gpg"
brew "gnupg"
brew "imagemagick"
brew "java"
brew "libjpeg"
brew "librsvg"
brew "libtiff"
brew "libxmlsec1"
brew "libxslt"
brew "little-cms2"
brew "macvim"
brew "nvm"
brew "openconnect"
brew "openssl"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@10"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "readline"
brew "redis"
brew "subversion"
brew "sqlite"
brew "tox"
brew "webp"
brew "xz"
brew "yarn"
brew "zlib"
brew "zsh"

cask "mactex"
cask "wkhtmltopdf"
cask "keepingyouawake"


# pinentry setup:
# echo "pinentry-program /usr/local/bin/pinentry-mac" >> ~/.gnupg/gpg-agent.conf
# echo "use-agent" >> ~/.gnupg/gpg.conf
# chmod 700 ~/.gnupg
# gpg --import <<<path-to-key>>>
